
&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.ИнформацияОСтудентах.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|СписокГруппы.Ссылка как ФИОСпр
	|ИЗ
	|Справочник.СписокГруппы как СписокГруппы";
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		НоваяСтрока = Объект.ИнформацияОСтудентах.Добавить();
		НоваяСтрока.ФИОСтудента = РезультатЗапроса.ФИОСпр;
	КонецЦикла;
	КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
