
Процедура ПечатьСпискаМатериальнойПомощи(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьСпискаМатериальнойПомощи)
	Макет = Документы.МатериальнаяПомощь.ПолучитьМакет("ПечатьСпискаМатериальнойПомощи");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МатериальнаяПомощь.Дата,
	|	МатериальнаяПомощь.ДатаПодписания,
	|	МатериальнаяПомощь.Комментарий,
	|	МатериальнаяПомощь.Номер,
	|	МатериальнаяПомощь.ТЧ_МатериальнаяПомощь.(
	|		НомерСтроки,
	|		ФИО,
	|		ИНН,
	|		Выписано
	|	)
	|ИЗ
	|	Документ.МатериальнаяПомощь КАК МатериальнаяПомощь
	|ГДЕ
	|	МатериальнаяПомощь.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЧ_МатериальнаяПомощьШапка = Макет.ПолучитьОбласть("ТЧ_МатериальнаяПомощьШапка");
	ОбластьТЧ_МатериальнаяПомощь = Макет.ПолучитьОбласть("ТЧ_МатериальнаяПомощь");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТЧ_МатериальнаяПомощьШапка);
		ВыборкаТЧ_МатериальнаяПомощь = Выборка.ТЧ_МатериальнаяПомощь.Выбрать();
		Пока ВыборкаТЧ_МатериальнаяПомощь.Следующий() Цикл
			ОбластьТЧ_МатериальнаяПомощь.Параметры.Заполнить(ВыборкаТЧ_МатериальнаяПомощь);
			ТабДок.Вывести(ОбластьТЧ_МатериальнаяПомощь, ВыборкаТЧ_МатериальнаяПомощь.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
