
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьИнформацииДляЖурнала)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьИнформацииДляЖурнала(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьИнформацииДляЖурнала(ТабДок, ПараметрКоманды)
	Документы.ИнформацияОСтудентах.ПечатьИнформацииДляЖурнала(ТабДок, ПараметрКоманды);
КонецПроцедуры
