
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьСпискаМатериальнойПомощи)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьСпискаМатериальнойПомощи(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьСпискаМатериальнойПомощи(ТабДок, ПараметрКоманды)
	Документы.МатериальнаяПомощь.ПечатьСпискаМатериальнойПомощи(ТабДок, ПараметрКоманды);
КонецПроцедуры
