
Процедура ПечатьИнформацииДляЖурнала(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьИнформацииДляЖурнала)
	Макет = Документы.ИнформацияОСтудентах.ПолучитьМакет("ПечатьИнформацииДляЖурнала");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнформацияОСтудентах.Дата,
	|	ИнформацияОСтудентах.Комментарий,
	|	ИнформацияОСтудентах.Номер,
	|	ИнформацияОСтудентах.ИнформацияОРодителях.(
	|		НомерСтроки,
	|		ФИОСтудента,
	|		ГдеИКемРаботаютРодители,
	|		АдресРодителей,
	|		АдресПроживанияСтудента
	|	)
	|ИЗ
	|	Документ.ИнформацияОСтудентах КАК ИнформацияОСтудентах
	|ГДЕ
	|	ИнформацияОСтудентах.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьИнформацияОРодителяхШапка = Макет.ПолучитьОбласть("ИнформацияОРодителяхШапка");
	ОбластьИнформацияОРодителях = Макет.ПолучитьОбласть("ИнформацияОРодителях");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьИнформацияОРодителяхШапка);
		ВыборкаИнформацияОРодителях = Выборка.ИнформацияОРодителях.Выбрать();
		Пока ВыборкаИнформацияОРодителях.Следующий() Цикл
			ОбластьИнформацияОРодителях.Параметры.Заполнить(ВыборкаИнформацияОРодителях);
			ТабДок.Вывести(ОбластьИнформацияОРодителях, ВыборкаИнформацияОРодителях.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
