Функция ВозратТаб() Экспорт

		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокГруппы.Ссылка КАК ФИОСпр
		|ИЗ
		|	Справочник.СписокГруппы КАК СписокГруппы
		|ГДЕ
		|	СписокГруппы.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Структура = новый Структура("Список");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Элементстр = Структура.Вставить().Список;
	Элементстр = ВыборкаДетальныеЗаписи.ФИОспр;
	КонецЦикла;

Возврат Структура
КонецФункции // ВозратТаб()




