
//&НаСервере
//Процедура ПриОткрытииНаСервере()
//	ЕСЛИ Объект.ТаблицаСтудентов.Количество() = 0 Тогда
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	СписокГруппы.Ссылка КАК ФИОСпр
//		|ИЗ
//		|	Справочник.СписокГруппы КАК СписокГруппы
//		|ГДЕ
//		|	СписокГруппы.ЭтоГруппа = ЛОЖЬ";
//		Результат = Запрос.Выполнить().Выбрать();
//		Пока Результат.Следующий() Цикл
//			НоваяСтрока = Объект.ТаблицаСтудентов.Добавить();
//			НоваяСтрока.ФИОСтудента = Результат.ФИОСпр;
//		КонецЦикла;
//	ИНАЧЕ
//		Сообщить("Таблица уже была заполнена. Оставляю как есть. Не забудьте проверить таблицу на ошибки и отсутствия некоторых данных");
//		Возврат;
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура ТАбвозвратНаФорме()
ДокументОбъект = РеквизитФормыВЗначение("Объект");
ДокументОбъект.ВозвратТаб();
                            
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	       ТАбвозвратНаФорме();
КонецПроцедуры
